Repository: caiofers/pet_pals
Catalog: lib/resources/l10n/app_*.arb
Languages: pt

# settingsPageLabel
source: Settings
pt: Configurações

# formSaveErrorText
source: Something went wrong, check the form fields and your internet connection
pt: Algo de errado aconteceu, confira os campos do formulário e a sua conexão com a internet

# loginText
source: Login
pt: Entrar

# logoutText
source: Logout
pt: Sair

# createAccountText
source: Create account
pt: Criar conta

# formLoginNameHintText
source: Put user name
pt: Digite seu nome

# formLoginNameLabelText
source: Name
pt: Nome

# formLoginNameEmptyErrorText
source: Please, enter with a name
pt: Por favor, digite seu nome

# formLoginEmailHintText
source: Put valid email
pt: Digite um email válido

# formLoginEmailEmptyErrorText
source: Please, enter with an email
pt: Por favor, digite um email

# formLoginEmailInvalidErrorText
source: Please, enter with a valid email
pt: Por favor, digite um email válido

# formLoginPasswordHintText
source: Enter with password
pt: Digite a senha

# formLoginPasswordLabelText
source: Password
pt: Senha

# formLoginPasswordEmptyErrorText
source: Please, enter with a password
pt: Por favor, digite a senha

# formLoginPasswordInvalidErrorText
source: Please, enter with an valid password (at least 6 characters)
pt: Por favor, digite uma senha válida (pelo menos 6 characteres)

# forgotPasswordButtonText
source: Forgot password
pt: Esqueci a senha

# changeToRegisterButtonText
source: Don't have account? Register now
pt: Não tem uma conte? Crie agora

# changeToLoginButtonText
source: Go back to login
pt: Voltar para login

# editProfileText
source: Edit profile
pt: Editar perfil

# unavailableFeat
source: Unavailable feature
pt: Funcionalidade indisponível

# helloUser
source: Hello, {userName}!
pt: Olá, {userName}!

# petScreenTitle
source: {userName}, {count, plural, =0{you do not have pets registered yet.} =1{this is your pet:} other{these are your pets:}}
pt: {userName}, {count, plural, =0{você ainda não tem pets cadastrados.} =1{esse é o seu pet:} other{esses são seus pets:}}

# addNewPetText
source: Add new pet
pt: Adicionar novo pet

# editPetText
source: Edit pet
pt: Editar pet

# managePetTutorsText
source: Manage pet tutors
pt: Gerenciar tutores do pet

# managePetAlarmsText
source: Manage pet alarms
pt: Gerenciar alarmes do pet

# deletePetText
source: Delete pet
pt: Excluir pet

# deletePetDialogTitle
source: Do you really want to delete this pet?
pt: Você realmente quer excluir o pet?

# deletePetDialogTitleSubtitle
source: You will lose everything about your pet.
pt: Você vai perder tudo seobre seu pet

# deletePetDialogCancelButtonText
source: Cancel
pt: Cancelar

# deletePetDialogConfirmButtonText
source: Delete
pt: Excluir

# petCardAgeText
source: Age: {age}
pt: Idade: {age}

# petCardBreedText
source: Breed: {breed}
pt: Raça: {breed}

# ageYears
source: {count, plural, =0{0 yrs} =1{1 yr} other{{count} yrs}}
pt: {count, plural, =0{0 a} =1{1 a} other{{count} a}}

# ageMonths
source: {count, plural, =0{0 mos} =1{1 mo} other{{count} mos}}
pt: {count, plural, =0{0 m} =1{1 m} other{{count} m}}

# connectiveAnd
source: and
pt: e

# petAttributeGenderText
source: Gender
pt: Gênero

# petAttributeAgeText
source: Age
pt: Idade

# petTutorsSectionTitle
source: Tutors
pt: Tutores

# petAlarmsSectionTitle
source: Alarms
pt: Alarmes

# petTypeDog
source: Dog
pt: Cachorro

# petTypeCat
source: Cat
pt: Gato

# petTypeFish
source: Fish
pt: Peixe

# petTypeBird
source: Bird
pt: Pássaro

# petGenderMale
source: Male
pt: Macho

# petGenderFemale
source: Female
pt: Fêmea

# addNewPetScreenTitle
source: Add new pet
pt: Adicionar novo pet

# editPetScreenTitle
source: Edit pet
pt: Editar pet

# formPetNameHintText
source: Put the pet's name
pt: Digite o nome do pet

# formPetNameLabelText
source: Pet's name
pt: Nome

# formPetNameEmptyErrorText
source: Please, put the pet's name.
pt: Por favor, digite o nome do pet.

# formPetTypeHintText
source: Select pet's type
pt: Selecione o tipo do pet

# formPetTypeLabelText
source: Pet's type
pt: Tipo

# formPetTypeEmptyErrorText
source: Please, select pet's type
pt: Por favor, selecione o tipo do pet.

# formPetBirthdateHintText
source: Select pet's birthdate
pt: Quando seu pet nasceu?

# formPetBirthdateLabelText
source: Pet's birthdate
pt: Data de nascimento

# formPetBirthdateEmptyErrorText
source: Please, select pet's birthdate
pt: Por favor, selecione a data de nascimento.

# formPetGenderHintText
source: Select pet's gender
pt: Selecione o gênero do pet

# formPetGenderLabelText
source: Pet's gender
pt: Gênero

# formPetGenderEmptyErrorText
source: Please, select pet's gender
pt: Por favor, selecione o gênero do pet

# formPetChangePetImageText
source: Change pet image
pt: Trocar imagem do pet

# formPetChangePetImageErrorText
source: Failed to pick image
pt: Falha ao selecionar imagem

# formPetBreedText
source: Select pet's breed
pt: Selecione a raça do pet

# cancelFormPetActionText
source: Cancel
pt: Cancelar

# saveFormPetActionText
source: Save
pt: Salvar

# cancelAddingFormPetDialogTitle
source: Cancel adding pet
pt: Cancelar a adição do pet?

# cancelEditingFormPetDialogTitle
source: Cancel editing pet
pt: Cancelar a edição do pet?

# cancelEditingFormPetDialogSubtitle
source: If you cancel will lose everything edited so far.
pt: Se você cancelar, vai perder tudo que foi editado até agora.

# cancelEditingFormPetDialogContinueButtonText
source: Continue editing
pt: Continuar editando

# cancelEditingFormPetDialogCancelButtonText
source: Lose edited
pt: Perder edição

# formSaveSucessText
source: Pet added with sucess
pt: Pet adicionado com sucesso

# alarmScreenTitle
source: {userName}, {count, plural, =0{you do not have alarms registered yet.} =1{this is your alarm:} other{these are your alarms:}}
pt: {userName}, {count, plural, =0{você ainda não tem alarmes cadastrados.} =1{esse é o seu alarme:} other{esses são seus alarmes:}}

# addNewAlarmText
source: Add new alarm
pt: Adicionar novo alarme
